Revit 2024 API
ExternalResourceTypes Class
Provides a container of all Revit built-in ExternalResourceType instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ExternalResourceTypes
Visual Basic
Public NotInheritable Class ExternalResourceTypes
Visual C++
public ref class ExternalResourceTypes abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceTypes
See Also
Autodesk.Revit.DB Namespace